---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DockablePane Properties
DockablePane Class See Also Send Feedback
---

The DockablePane type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The unique identifier for this dockable pane. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DockablePane Class

Autodesk.Revit.UI Namespace